# ==========================================
# ЭТАП 1: Сборка бинарного файла (Builder)
# ==========================================
# AS builder — даем этому этапу имя, чтобы обратиться к нему позже.
FROM golang:1.25-alpine AS builder

# Указываем рабочую папку внутри контейнера, где будут происходить все действия
WORKDIR /build

# Сначала копируем файлы зависимостей. 
# Зачем отдельно: Docker кэширует слои. Если модули не менялись, он не будет скачивать их заново.
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь оставшийся исходный код нашего проекта в контейнер
COPY . .

# Собираем наше Go-приложение в один независимый исполняемый файл
# CGO_ENABLED=0 отключает зависимости от системных библиотек C (сборка будет полностью автономной)
# GOOS=linux гарантирует, что файл скомпилируется под Linux, даже если мы запускаем сборку из Windows
RUN CGO_ENABLED=0 GOOS=linux go build -o /app/task-server ./cmd/task-server


# ==========================================
# ЭТАП 2: Финальный минимальный образ
# ==========================================
# Берем alpine — самый крошечный и безопасный дистрибутив Linux (весит всего 5 МБ)
FROM alpine:latest

# Добавляем в Linux корневые сертификаты безопасности.
# Зачем: без них наш сервер не сможет делать защищенные HTTPS запросы во внешний мир (например, к Telegram API)
RUN apk --no-cache add ca-certificates

# Из папки предыдущего этапа (который мы назвали builder) копируем ТОЛЬКО готовый скомпилированный файл
COPY --from=builder /app/task-server /task-server

# Сообщаем Docker, что наше приложение внутри контейнера слушает порт 8080
EXPOSE 8080

# Команда, которая выполнится автоматически при старте контейнера — запускаем наш сервер
CMD ["/task-server"]
